// Home work 7
// 1. С какими интерфейсами мы уже сталкивались в предыдущих уроках?
// Обратите внимание на уроки, в которых мы читали из стандартного ввода и писали в стандартный вывод.
// Ответ:
// Из предыдущих уроков, довелось использовать интерфейв io.Reader

// type Reader interface {
// 	Read(p []byte) (n int, err error)
// }

// 2. Посмотрите примеры кода в своём портфолио. Везде ли ошибки обрабатываются грамотно?
// Хотите ли вы переписать какие-либо функции?
// Да, есть моменты где я "проглатываю" ошибки в задании с калькулятором. Калькулятор обязательно
// перепишу и скину вам на проверку.
